Revit 2027 API
Stone.StonePattern Property
 The property labeled "Relief Pattern" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string StonePattern { get; }
Public Shared ReadOnly Property StonePattern As String
	Get
public:
static property String^ StonePattern {
	String^ get ();
}
static member StonePattern : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StonePatternType".
See Also
Reference
Stone Class
Autodesk.Revit.DB.Visual Namespace